** Insteresting function

#+BEGIN_SRC emacs-lisp
(setq x 10)
(* x x)
#+END_SRC

#+RESULTS:
: 100

是不是很直观，明晰

- <s 按TAB         创建一个上面的框架
- emacs-lisp       紧跟着敲写emacs-lisp
- (setq x 10)      敲入这两个S表达式,并在每个括号后面按一次C-x C-e
  (* x x)      你会在回显区内看到他们的计算结果
- C-c C-c          在(* x x)括号后执行一次,就会看到结果打印在下面了

把 emacs-lisp 换成你熟悉的编程语言试试

